<?php

// +----------------------------------------------------------------------
// | Description: 推送通知
// +----------------------------------------------------------------------
// | Author:  orchief
// +----------------------------------------------------------------------

namespace Push;

class Push
{
	/**
	 * 短信消息模板列表 模板变量什么的
	
	 		支付订单***—***（凌翠通), （赠送/获得）折扣券***
      您挂售的订单 ***88产生的挂售收益  +***（凌翠通）
      用户<***>向您的转账   +*****  （翡翠积分）（凌翠通）
			本月消费已达20000到业绩要求，将即时享受推荐佣金返还
			您推荐的用户《****》成功支付订单******* 返还给您的佣金   ****（凌翠通）
			您在凌翠商城所购买的****商品已发货，请您及时关注

	 */
	protected static $sms_list = [
		'payorder'			=>		['支付订单${orderId}—${amount}（凌翠通), {typeName}折扣券${coupon}', 'sfsfsfd'],	// 第一项是消息模板内容 第二项是阿里云短信模板id
		'guashou'	  		=>		['您挂售的订单 ${orderId}产生的挂售收益  +${amount}（凌翠通）', 'sfsfsfd'],
		'trans'					=>		['用户<${username}>向您的转账   + $amount （$typeName)', 'sfsfsfd'],
		'expendgtmin'		=>		['本月消费已达${min}到业绩要求，将即时享受推荐佣金返还', 'sfsfsfd'],
		'refer'					=>		['您推荐的用户《${username}》成功支付订单${orderId} 返还给您的佣金   ${amount}（凌翠通）', 'sfsfsfd'],
		'ship'					=>		['您在凌翠商城所购买的${productName}商品已发货，请您及时关注', 'sfsfsfd']
	];

	
	/**	
	 * 发送推送消息
	 */
    public static function run($content)
    {
		// TODO: 短信推送 不同的事件 调用不同的短息消息模板

		// TODO: 友盟推送
    }
}
